Term4/teorver/lectures/6.tex
% Created 2021-04-24 Sat 12:56
% Intended LaTeX compiler: pdflatex

\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{lipsum}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}
\usetikzlibrary{automata, arrows}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}
\newcommand{\llb}{\llbracket}
\newcommand{\rrb}{\rrbracket}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\A}{\mathfrak{A}}
\newcommand{\B}{\mathfrak{B}}
\newcommand{\rank}{\mathop{\rm rank}\nolimits}
\newcommand{\const}{\var{const}}
\newcommand{\grad}{\mathop{\rm grad}\nolimits}

\newcommand{\todo}{{\color{red}\fbox{\text{Доделать}}}}
\newcommand{\fixme}{{\color{red}\fbox{\text{Исправить}}}}

\newcounter{propertycnt}
\setcounter{propertycnt}{1}
\newcommand{\beginproperty}{\setcounter{propertycnt}{1}}

\theoremstyle{plain}
\newtheorem{propertyinner}{Свойство}
\newenvironment{property}{
  \renewcommand\thepropertyinner{\arabic{propertycnt}}
  \propertyinner
}{\endpropertyinner\stepcounter{propertycnt}}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother

\newenvironment{rualgo}[1][]
  {\begin{algorithm}[#1]
     \selectlanguage{russian}%
     \floatname{algorithm}{Алгоритм}%
     \renewcommand{\algorithmicif}{{\color{red}\textbf{если}}}%
     \renewcommand{\algorithmicthen}{{\color{red}\textbf{тогда}}}%
     \renewcommand{\algorithmicelse}{{\color{red}\textbf{иначе}}}%
     \renewcommand{\algorithmicend}{{\color{red}\textbf{конец}}}%
     \renewcommand{\algorithmicfor}{{\color{red}\textbf{для}}}%
     \renewcommand{\algorithmicto}{{\color{red}\textbf{до}}}%
     \renewcommand{\algorithmicdo}{{\color{red}\textbf{делать}}}%
     \renewcommand{\algorithmicwhile}{{\color{red}\textbf{пока}}}%
     \renewcommand{\algorithmicrepeat}{{\color{red}\textbf{повторять}}}%
     \renewcommand{\algorithmicuntil}{{\color{red}\textbf{до тех пор пока}}}%
     \renewcommand{\algorithmicloop}{{\color{red}\textbf{повторять}}}%
     \renewcommand{\algorithmicnot}{{\color{blue}\textbf{не}}}%
     \renewcommand{\algorithmicand}{{\color{blue}\textbf{и}}}%
     \renewcommand{\algorithmicor}{{\color{blue}\textbf{или}}}%
     \renewcommand{\algorithmicrequire}{{\color{blue}\textbf{Ввод}}}%
     \renewcommand{\algorithmicensure}{{\color{blue}\textbf{Вывод}}}%
     \renewcommand{\algorithmicreturn}{{\color{red}\textbf{Вернуть}}}%
     \renewcommand{\algorithmicrtrue}{{\color{blue}\textbf{истинна}}}%
     \renewcommand{\algorithmicrfalse}{{\color{blue}\textbf{ложь}}}%
     % Set other language requirements
  }
  {\end{algorithm}}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 6}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 6},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\newcommand{\todo}{{\color{red}\text{Доделать }}}
\newcommand{\fixme}{{\color{red}\text{Исправить }}}


\section{Случайные величины}
\label{sec:org01dd90c}
\begin{symb}
\(\xi\) --- \textbf{Случайная величина}
\end{symb}
\begin{examp}
\(\xi\) --- число выпавших очков. \(\xi \in \{1, 2, 3, 4, 5, 6\}\)
\end{examp}
\begin{examp}
\(\xi\) --- время работы микросхемы до отказа
\begin{enumerate}
\item Время работы в часах \\
\(\xi = \{1, 2, 3, \dots \}\)
\item Время работы измеряем точно \\
\(\xi \in [0, +\infty]\)
\end{enumerate}
\end{examp}
\begin{examp}
\(\xi\) --- температура воздуха в случайный момент времени. \(\xi \in (-50^\circ, 50^\circ)\)
\end{examp}
\begin{examp}
Индикатор события \(A\).
\[I_A(\omega) \in \begin{cases} 0 & , \omega \not \in A \\ 1 & , \omega \in A\end{cases}\]
\end{examp}
\begin{definition}
Пусть имеется вероятностное пространство \((\Omega, \mathcal{F}, p)\). Функция \(\xi: \Omega \to \R\) называется \textbf{\(\mathcal{F}\)-измеримой}, если \(\forall x \in \R:\ \{\omega | \xi(\omega) < x\} \in \mathcal{F}\). Т.е прообраз \(\xi^{-1}((- \infty, x)) \in \mathcal{F}\)
\end{definition}
\begin{definition}
\textbf{Случайной величиной} \(\xi\) заданной на вероятностном пространстве \((\Omega, \mathcal{F}, p)\)  называется \(\mathcal{F}\)-измеримая функция \fixme, ставящая в соответствие каждому элементарному исходу \(\omega\) некоторое вещественное число
\end{definition}
\begin{examp}
Бросаем кость.
\begin{itemize}
\item \(\Omega = \{1, 2, 3, 4, 5, 6\}\)
\item \(\mathcal{F} = \{\emptyset, \Omega, \{1, 3, 5\}, \{2, 4, 6\}\}\)
\item \(] \xi(i) = i\)
\end{itemize}
Если \(x = 4\), то \(\{\omega | \xi(\omega) < 4\} = \{1, 2, 3\} \not\in \mathcal{F}\) \(\Rightarrow\) \(\xi\) не является \(\mathcal{F}\)-измеримой
\end{examp}
\subsection{Смысл измеримости}
\label{sec:org444d89c}
Пусть случайная величина \(\xi: \Omega \to \R\) --- измеримая. Тогда \(P(\xi < x) = P(\{\omega | \xi(\omega) < x\})\), т.к. \(A_x = \{\omega | \xi(\omega) < x\} \in \mathcal{F}\). Тогда \[\overline{A_x} = \{\omega | \xi(\omega) \ge x\} \in \mathcal{F}\] \[A_x \setminus B_y = \{\omega | t \le \xi(\omega) le x\} \in \mathcal{F}\]
\[ B_x = \todo \]
\[ B_x \setminus A_x = \{\omega | \xi(\omega) = x\} \in \mathcal{F} \]
Отсюда видим, по теореме Каво?\fixme  можно однозначно продолжить до любого Борелевского множества на прямой. \(B \in \mathcal{B}\) --- Борелевская \(\sigma\)-алгебра. \(P(B \in \mathcal{B}) = P\{\omega | \xi(\omega) \in B\}\) \\
Пусть случайная величина задана на вероятностном пространстве \((\Omega, \mathcal{F}, p)\). Тогда:
\begin{enumerate}
\item \((\Omega, \mathcal{F}, p) \xrightarrow[]{\xi} (\R, \mathcal{B}, p)\) --- новое вероятностное пространство
\item \(\xi^{-1}(B)\ \forall B \in \mathcal{B}\) \\
\(\mathcal{F}_\xi \subset \mathcal{F}\) \\
\(\mathcal{F}_\xi\) --- \(\sigma\)-алгебра порожденная величиной \(\xi\)
\end{enumerate}
\begin{task}
Найти \(\sigma\)-алгебру порожденную индикатором
\end{task}
\begin{definition}
Функция \(P(B)\ B \in \mathcal{B}\) называется \textbf{распределением вероятностей} случайной величины \(\xi(\omega)\). Т.е. распределение случайной величины это соответствие множествами на вещественной прямой и вероятностями случайной величины попасть в это множество
\end{definition}
\subsection{Типы распределения}
\label{sec:orgd2b53e7}
\begin{itemize}
\item Дискретные
\item Абсолютно непрерывные
\item Смешанные
\item Сингулярные (непрерывные но не абсолютно непрерывные)
\end{itemize}
\subsubsection{Дискретные}
\label{sec:orgd89bcd3}
Случайная величина \(\xi\) имеет дискретное распределение, если она принимает не более чем счетное число значений, т.е. существует конечный или счетный набор чисел \(\{x_1, x_2, \dots, x_n, \dots\}\), такой что
\begin{enumerate}
\item \(p_i = p(\xi = x_i) > 0\)
\item \(\sum\limits_i p_i = 1\)
\end{enumerate}
\begin{center}
\begin{tabular}{l|lllll}
\(\xi\) & \(x_1\) & \(x_2\) & \(\dots\) & \(x_n\) & \(\dots\)\\
\hline
\(p\) & \(p_1\) & \(p_2\) & \(\dots\) & \(p_n\) & \(\dots\)\\
\end{tabular}
\end{center}
\todo
\begin{examp}
Кость
\begin{center}
\begin{tabular}{l|rrrrrr}
\(\xi\) & 1 & 2 & 3 & 4 & 5 & 6\\
\hline
\(p\) & \(\frac{1}{6}\) & \(\frac{1}{6}\) & \(\frac{1}{6}\) & \(\frac{1}{6}\) & \(\frac{1}{6}\) & \(\frac{1}{6}\)\\
\end{tabular}
\end{center}
\todo
\label{org395c8a2}
\end{examp}
\begin{enumerate}
\item Основные числовые характеристики
\label{sec:orgbce4ad0}
\begin{enumerate}
\item Математическое ожидание(среднее значение)
\label{sec:org8905d9e}
\begin{defintion}
\textbf{Математическим ожиданием} случайной величины \(\xi\) называется число:
\[ E\xi = \sum\limits_i x_i p_i \] при условии что данный ряд сходится абсолютно, иначе говорят что математическое ожидание не существует
\end{defintion}
\begin{symb}
E\(\xi\)
\end{symb}
\begin{remark}
Смысл: среднее значение, число вокруг которого группируется значения случайной величины. Физический смысл: центр масс. Статистический смысл: среднее арифметическое наблюдаемых значений при большом значении реальных экспериментов
\end{remark}
\item Дисперсия
\label{sec:orgc92568a}
\begin{definition}
\textbf{Дисперсией} \(D\xi\) случайной величины \(\xi\) называется среднее квадратов отклонений ее от математического ожидания
\[ D\xi = E(\xi - E\xi)^2 \] или \[D\xi = \sum\limits_i (x_i - E\xi)^2 p_i \]
При условии что данное среднее значение существует(конечно)
\end{definition}
\begin{remark}
Вычислять дисперсию удобнее по формуле \[ D\xi = E\xi^2 - (E\xi)^2  = \sum\limits_i x_i^2p_i - (E\xi)^2\]
\end{remark}
\begin{remark}
Смысл: квадрат среднего разброса(рассеяния) случайной величины около ее математического ожидания
\end{remark}
\item Среднее квадратичное отклонение
\label{sec:org4e71742}
\begin{definition}
\textbf{Средним квадратичным отклонением} (\(\sigma\)\textsubscript{\(\xi\)} = \(\sigma\)(\(\xi\))) случайной величины \(\xi\) называется число
\[ \sigma = \sqrt{D\xi} \]
\end{definition}
\begin{remark}
Смысл: характеризует средний разброс случайной величины около ее математического ожидания
\end{remark}
\begin{examp}
\hyperref[org395c8a2]{Бросаем кость}
\[ E\xi = 1\cdot \frac{1}{6} + 2 \cdot \frac{1}{6}  + 3 \cdot \frac{1}{6} + 4 \cdot \frac{1}{6} + 5 \cdot \frac{1}{6} + 6 \cdot \frac{1}{6} = 3.5 \]
\[ D\xi = 1^2 \cdot \frac{1}{6} + 2^2 \cdot \frac{1}{6} + 3^2 \cdot \frac{1}{6} + 4^2 \cdot \frac{1}{6} + 5^2 \cdot \frac{1}{6} + 6^2 \cdot \frac{1}{6} - 3.5^2 = 2.92 \]
\[ \sigma = \sqrt{2.92} \approx 1 \neq 1 \]
\end{examp}
\end{enumerate}
\item Свойства математического ожидания и дисперсии
\label{sec:orgd162d34}
\begin{definition}
Случайная величина \(\xi\) имеет вырожденное распределение, если \(\xi(\omega) = C = \const\ \forall \omega \in \Omega\) или \(p(\xi = C) = 1\)
\[ E \xi = C = \const \]
\[ D \xi = 0 \]
\end{definition}
\begin{proof}
\todo
\end{proof}
\begin{definition}[Свойство сдвига]
\[E(\xi + C) + E\xi + C\]
\[ D(\xi + C) = D \xi \]
\end{definition}
\begin{proof}
\todo
\end{proof}
\begin{definition}
\[ E(C\xi) = CE\xi \]
\[ D(C\xi) = C^2D\xi \]
\end{definition}
\begin{proof}
\todo
\end{proof}
\begin{definition}
\[ E(\xi + \eta) = E\xi + E\eta \]
\end{definition}
\begin{proof}
\-
\begin{itemize}
\item Пусть \(x_i, y_i\) --- соответствующие значения случайных величин \(xi\) и \(mu\)
\end{itemize}
\[ E(\xi + \eta) = \sum\limits_{i, j} (x_i + y_j) p(\xi = x_i, \eta = y_j) = \sum\limits_i x_i \sum\limits_j p(\xi = x_i, \eta = y_j) + \sum\limits_j y_j \sum p(\xi = x_i, \eta = y_j) \]
\todo
\end{proof}
\begin{definition}
Дискретные случайные величины \textbf{независимы} если \(\forall i, j\ p(\xi = x_i, \eta = y_j) = p(\xi = x_i) \cdot p(\eta = y_j)\)
\label{org435a227}
\end{definition}
\begin{remark}
Если \(xi\) и \(\eta\) независимы, то
\[ E(\xi\eta) = E\xi\cdot E\eta \]
обратное не верно
\end{remark}
\begin{proof}
\[ E(\xi\eta) = \sum\limits_{ij} (x_i y_j)p(\xi = x_i, \eta = y_j) = \sum\limits_i x_i \sum\limits_j y_j(\xi = x_i, \eta = y_j) = \]
\[ = \sum\limits_i x_i \sum\limits_j y_j p(\xi = x_j)p(\eta = y_j) = \sum\limits_i x_i p(\xi = x_i) \cdot \sum\limits_j y_j p(\eta = y_j) = E\xi \cdot E\eta\]
\end{proof}
\begin{proof}
\[ D\xi = E\xi^2 - (E\xi)^2 \]
\[ D\xi = E(\xi - E\xi)^2 = E(\xi - 2\xi E\xi + (E\xi)^2) = E\xi^2 - 2E\xi E\xi + E(E\xi)^2 = \]
\[ E\xi^2 - 2(E\xi)^2 + (E\xi)^2 = E\xi^2 - (E\xi)^2 \]
\end{proof}
\begin{remark}
\[ D(\xi + \eta) = D\xi + D\eta + 2\text{Cov}(\xi, eta) \]
, где \(\text{Cov}(\xi, \eta) = E(\xi\eta) - E\xi\cdot E\eta\) --- \textbf{ковариация}
\end{remark}
\begin{proof}
\[ D(\xi + \eta) = E(\xi + \eta)^2 - (E(\xi + \eta))^2 = E\xi^2 + 2E\xi\eta + E\eta^2 - (E\xi)^2 - 2E\xi\cdot E\eta - (E\eta)^2 = \]
\[ D\xi + D\eta + 2(E(\xi\eta) - E\xi \cdot E\eta) \]
\end{proof}
\begin{remark}
Если случайные величины \(\xi\) и \(\eta\) независимые, то
\[ D(\xi + \eta) = D\xi + \eta \]
\end{remark}
\begin{proof}
По \hyperref[org435a227]{свойству} \(\text{Cov}(\xi, \eta) = 0\)
\end{proof}
\begin{remark}
Среднее квадратичное отклонение --- минимум отклонения случайной величины от точек вещественной прямой, т.е.
\[ D\xi = \min\limits_a (y - a) \fixme \]
\end{remark}
\begin{proof}
\[ E(\xi - a)^2 = E((\xi - E\xi) + (E\xi - a))^2 = E(\xi - E\xi)^2 + \underbrace{2E(\xi - E\xi)\cdot(E\xi - a)}_0 + (E\xi - a)^2 =  \]
\[ = D\xi + (E\xi - a)^2 \le D\xi \]
\end{proof}
\item Другие числовые характеристики
\label{sec:orgf999224}
\begin{remark}
\[ m_k = E\xi^k \] --- момент \(k\)-того порядка \\
В частности \(m_1 = E\xi\)
\end{remark}
\begin{remark}
\[ E|\xi|^k \] --- абсолютный момент \(k\)-того порядка
\end{remark}
\begin{remark}
\[ \mu_k = E(\xi - E\xi)^k \] --- центральный момент \(k\)-того порядка \\
В частности \(\mu_2 = D\xi\)
\end{remark}
\begin{remark}
\[ E|\xi - E\xi|^2 \] --- абсолютный центральный момент \(k\)-того порядка
\end{remark}
\begin{remark}
Центральные моменты можно выразить через относительные моменты
\todo
\end{remark}
\begin{remark}
\textbf{Модой} \(\text{Mo}\) называется такое значение случайной величины, где вероятность события является наибольшей
\[ p(\xi = \text{Mo}) = \max\limits_i p_i \]
\end{remark}
\begin{definition}
\textbf{Медианой} \(\text{Me}\) называется значение случайной величины такое что, \[p(\xi < \text{Me}) = p(\xi > \text{Me}) = \frac{1}{2}\]
\end{definition}
\end{enumerate}
\end{document}
